GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_spi.c
            dma_transfer_number_config(spi_device->dma_rx->periph, spi_device->dma_rx->channel, size);
            dma_interrupt_enable(spi_device->dma_rx->periph, spi_device->dma_rx->channel, DMA_CHXCTL_FTFIE);
            dma_channel_enable(spi_device->dma_rx->periph, spi_device->dma_rx->channel);
            spi_dma_enable(spi_periph, SPI_DMA_RECEIVE);
        }
        
        /* Configure TX DMA */
        if (spi_device->dma_tx != RT_NULL)
        {
            dma_channel_disable(spi_device->dma_tx->periph, spi_device->dma_tx->channel);
            
            if (send_ptr != RT_NULL)
            {
                dma_memory_address_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, 
                                         DMA_MEMORY_0, (uint32_t)send_ptr);
                dma_memory_address_generation_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, DMA_MEMORY_INCREASE_ENABLE);
            }
            else
            {
                dma_memory_address_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, 
                                         DMA_MEMORY_0, (uint32_t)&dummy_tx);
                dma_memory_address_generation_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, DMA_MEMORY_INCREASE_DISABLE);
            }
            
            dma_transfer_number_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, size);
            dma_interrupt_enable(spi_device->dma_tx->periph, spi_device->dma_tx->channel, DMA_CHXCTL_FTFIE);
            dma_channel_enable(spi_device->dma_tx->periph, spi_device->dma_tx->channel);
            spi_dma_enable(spi_periph, SPI_DMA_TRANSMIT);
        }
        
        /* Wait for transfer complete with timeout */
        rt_tick_t timeout = rt_tick_from_millisecond(1000);
        rt_tick_t start = rt_tick_get();
        
        while (1)
        {
            rt_bool_t tx_done = RT_TRUE;
            rt_bool_t rx_done = RT_TRUE;
            
            if (spi_device->dma_tx != RT_NULL)
            {
                tx_done = (dma_flag_get(spi_device->dma_tx->periph, spi_device->dma_tx->channel, DMA_FLAG_FTF) == SET);
            }
            
            if (spi_device->dma_rx != RT_NULL)
            {
                rx_done = (dma_flag_get(spi_device->dma_rx->periph, spi_device->dma_rx->channel, DMA_FLAG_FTF) == SET);
            }
            
            if (tx_done && rx_done)
            {
                break;
            }
            
            if (rt_tick_get() - start > timeout)
            {
                LOG_E("%s DMA transfer timeout", spi_device->bus_name);
                break;
            }
            
            rt_thread_mdelay(1);
        }
        
        /* Wait for SPI idle */
        while (RESET != spi_i2s_flag_get(spi_periph, SPI_FLAG_TRANS));
        
        /* Disable DMA and clear flags */
        if (spi_device->dma_rx != RT_NULL)
        {
            dma_channel_disable(spi_device->dma_rx->periph, spi_device->dma_rx->channel);
            dma_flag_clear(spi_device->dma_rx->periph, spi_device->dma_rx->channel, DMA_FLAG_FTF);
            spi_dma_disable(spi_periph, SPI_DMA_RECEIVE);
        }
        
        if (spi_device->dma_tx != RT_NULL)
        {
            dma_channel_disable(spi_device->dma_tx->periph, spi_device->dma_tx->channel);
            dma_flag_clear(spi_device->dma_tx->periph, spi_device->dma_tx->channel, DMA_FLAG_FTF);
            spi_dma_disable(spi_periph, SPI_DMA_TRANSMIT);
        }
        
        LOG_D("spi DMA transfer finish");
    }
    else
#endif /* BSP_USING_SPI_TX_DMA || BSP_USING_SPI_RX_DMA */
    {
        if(config->data_width <= 8)
        {
            const rt_uint8_t * send_ptr = message->send_buf;
            rt_uint8_t * recv_ptr = message->recv_buf;
            rt_uint32_t size = message->length;

            LOG_D("spi poll transfer start: %d\n", size);

            while(size--)
            {
                rt_uint8_t data = 0xFF;

                if(send_ptr != RT_NULL)
                {
                    data = *send_ptr++;
                }

                /* Todo: replace register read/write by gd32f4 lib */
                /* Wait until the transmit buffer is empty */
                #if defined (SOC_SERIES_GD32H7xx) || defined (SOC_SERIES_GD32H75E) || defined (SOC_SERIES_GD32H77x)
                spi_master_transfer_start(spi_periph, SPI_TRANS_START);
                while(RESET == spi_i2s_flag_get(spi_periph, SPI_FLAG_TP));
                #else
                while(RESET == spi_i2s_flag_get(spi_periph, SPI_FLAG_TBE));
                #endif
                /* Send the byte */
                spi_i2s_data_transmit(spi_periph, data);

                /* Wait until a data is received */
                #if defined (SOC_SERIES_GD32H7xx) || defined (SOC_SERIES_GD32H75E) || defined (SOC_SERIES_GD32H77x)
                while(RESET == spi_i2s_flag_get(spi_periph, SPI_FLAG_RP));
                #else
                while(RESET == spi_i2s_flag_get(spi_periph, SPI_FLAG_RBNE));
                #endif
                /* Get the received data */
                data = spi_i2s_data_receive(spi_periph);

                if(recv_ptr != RT_NULL)
                {
                    *recv_ptr++ = data;
                }
            }
            LOG_D("spi poll transfer finsh\n");
        }
        else if(config->data_width <= 16)
        {
            const rt_uint16_t * send_ptr = message->send_buf;
            rt_uint16_t * recv_ptr = message->recv_buf;
            rt_uint32_t size = message->length;

            while(size--)
            {
                rt_uint16_t data = 0xFF;

                if(send_ptr != RT_NULL)
                {
                    data = *send_ptr++;
                }

                /* Wait until the transmit buffer is empty */
                #if defined (SOC_SERIES_GD32H7xx) || defined (SOC_SERIES_GD32H75E) || defined (SOC_SERIES_GD32H77x)
                spi_master_transfer_start(spi_periph, SPI_TRANS_START);
                while(RESET == spi_i2s_flag_get(spi_periph, SPI_FLAG_TP));
                #else
                while(RESET == spi_i2s_flag_get(spi_periph, SPI_FLAG_TBE));
                #endif
                /* Send the byte */
                spi_i2s_data_transmit(spi_periph, data);

